tests/fixtures/hello/hello.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e. -->
<!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e. -->
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://hello/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="http://hello/" name="HelloImplService">
    <types />
    <message name="getHelloAsString">
        <part name="arg0" type="xsd:string" />
    </message>
    <message name="getHelloAsStringResponse">
        <part name="return" type="xsd:string" />
    </message>
    <portType name="Hello">
        <operation name="getHelloAsString">
            <input wsam:Action="http://hello/Hello/getHelloAsStringRequest" message="tns:getHelloAsString" />
            <output wsam:Action="http://hello/Hello/getHelloAsStringResponse" message="tns:getHelloAsStringResponse" />
        </operation>
    </portType>
    <binding name="HelloImplPortBinding" type="tns:Hello">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc" />
        <operation name="getHelloAsString">
            <soap:operation soapAction="" />
            <input>
                <soap:body use="literal" namespace="http://hello/" />
            </input>
            <output>
                <soap:body use="literal" namespace="http://hello/" />
            </output>
        </operation>
    </binding>
    <service name="HelloImplService">
        <port name="HelloImplPort" binding="tns:HelloImplPortBinding">
            <soap:address location="http://localhost:9999/ws/hello" />
        </port>
    </service>
</definitions>
